"""Constants used in the client and server."""

# Размер игрового поля
SIZE = (10, 10)

# Доступное оружие и его урон
WEAPONS = {"sword": 10, "spear": 15, "axe": 20}

# ASCII-арт для особого монстра jgsbat
JGSBAT_ASCII_ART = r"""
        ,_                    _,
        ) '-._  ,_    _,  _.-' (
        )  _.-'.|\\\\--//|.'-._  (
         )'   .'\/o\/o\/'.   `(
          ) .' . \====/ . '. (
           )  / <<    >> \  (
            '-._/``  ``\_.-'
      jgs     __\\\\'--'//__
             (((""`  `"")))
"""
